var n = 0;

var all = new Array("Кухонный нож\n", "Огненый нож\n", "Нож из сосульки\n", "Булава\n", "Острый камень\n", "Доска с гвоздём\n", "Бита\n", "Лук\n", "Посох\n", "Магический камень\n", "Писолет\n", "Регенерирующийся камень\n", "Чуйка\n", "Харчок\n", "Деревянный шлем\n", "Медный шлем\n", "Каменный шлем\n", "Железный шлем\n", "Серебряный шлем\n", "Золотой шлем\n", "Алмазный шлем\n", "Деревянные латы\n", "Медные латы\n", "Каменные латы\n", "Железный латы\n", "Серебряные латы\n", "Золотые латы\n", "Алмазные латы\n");
var bag = new Array();
var
    kol = 0;
hp = 100;
win = 0;
winth = 0;
nhp = hp;
nom = 0;
lvl = 1;

var
    xp = 0;
mindmg = 30;
maxdmg = 50;
def = 0;
rec = 0;
drop = 0;
var
    zak = 0;
chanse = 0;
dopdmg = 0;
closedmg = 0;
pro = 0;
var
    bossname = "name";

bosshp = 700;
bossmindmg = 1;
bossmaxdmg = 10;
nbosshp = bosshp;
var
    war = 0;
game = 0;
a = 0;